# GraphicDisplayOptionsBackground Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GraphicDisplayOptionsBackground Property
ParameterTypeId Class See Also
---
"Background"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GraphicDisplayOptionsBackground { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GraphicDisplayOptionsBackground As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GraphicDisplayOptionsBackground {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace